# ============================
# Brewfile - Homebrew Dependencies
# ============================
# Install all dependencies: brew bundle install
# Update all dependencies: brew bundle install --force
# Cleanup unused packages: brew bundle cleanup

# ============================
# Terminals
# ============================
brew "ghostty"

# ============================
# Shell & Prompt
# ============================
brew "zsh"
brew "starship"
brew "fzf"

# ============================
# CLI Utilities
# ============================
brew "eza"                 # Modern ls replacement
brew "bat"                 # Modern cat replacement
brew "bottom"              # System monitor
brew "git-delta"           # Better git diffs
brew "lazygit"             # Git TUI
brew "ripgrep"             # Fast grep alternative
brew "fd"                  # Fast find alternative
brew "jq"                  # JSON processor
brew "yq"                  # YAML processor

# ============================
# Editors
# ============================
brew "neovim"

# ============================
# Development Tools
# ============================
brew "git"
brew "gh"                  # GitHub CLI

# ============================
# Version Managers
# ============================
brew "nvm"                 # Node version manager

# ============================
# Validation & Linting Tools
# ============================
brew "stylua"              # Lua formatter
brew "shellcheck"          # Shell script linter

# ============================
# Optional Tools
# ============================
# Uncomment if needed:
# brew "direnv"            # Per-directory environment variables
# brew "xclip"             # Linux clipboard (Linux only)
